Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: The system (204) of any of claims 10 to 14, wherein commanding an angle change of the propeller blades comprises commanding an angle change to a target blade pitch that is less than a maximum blade pitch.
de_de: System (204) nach einem der Ansprüche 10 bis 14, wobei Befehlen einer Winkeländerung der Propellerblätter Befehlen einer Winkeländerung bis auf eine Sollblattsteigung umfasst, die kleiner als eine maximale Blattsteigung ist.

source: 1. A fuel nozzle (70) for a gas turbine engine (20), the fuel nozzle (70) comprising:
de_de: 1. Brennstoffdüse (70) für ein Gasturbinentriebwerk (20), wobei die Brennstoffdüse (70) umfasst:

source: a first fuel nozzle body (72); and
de_de: einen ersten Brennstoffdüsenkörper (72); und

source: a second fuel nozzle body (74) mounted to the first fuel nozzle body (72), wherein:
de_de: einen zweiten Brennstoffdüsenkörper (74), der an dem ersten Brennstoffdüsenkörper (72) montiert ist, wobei:

source: the first fuel nozzle body (72) and the second fuel nozzle body (74) form a fuel passage (78), the fuel passage (78) includes a fuel accumulation chamber (80), an upstream fuel passage (112), a downstream fuel passage (114), and a plurality of tangential feed holes (116);
de_de: der erste Brennstoffdüsenkörper (72) und der zweite Brennstoffdüsenkörper (74) einen Brennstoffkanal (78) bilden, wobei der Brennstoffkanal (78) eine Brennstoffsammelkammer (80), einen stromaufwärtigen Brennstoffkanal (112), einen stromabwärtigen Brennstoffkanal (114) und eine Vielzahl von tangentialen Zufuhrlöchern (116) beinhaltet;

source: the accumulation chamber (80) is formed by the first fuel nozzle body (72) and the second fuel nozzle body (74);
de_de: die Sammelkammer (80) durch den ersten Brennstoffdüsenkörper (72) und den zweiten Brennstoffdüsenkörper (74) gebildet ist;

source: the upstream fuel passage (112) is formed by the first fuel nozzle body (72), the upstream fuel passage (112) extends along an upstream fuel passage centerline (118) to a terminal end (120) of the upstream fuel passage (112), and the terminal end (120) is spaced from the accumulation chamber (80);
de_de: der stromaufwärtige Brennstoffkanal (112) durch den ersten Brennstoffdüsenkörper (72) gebildet ist, wobei sich der stromaufwärtige Brennstoffkanal (112) entlang einer stromaufwärtigen Brennstoffkanalmittellinie (118) zu einem Anschlussende (120) des stromaufwärtigen Brennstoffkanals (112) erstreckt und das Anschlussende (120) von der Sammelkammer (80) beabstandet ist;

source: the downstream fuel passage (114) is formed by the second fuel nozzle body (74), the downstream fuel passage (114) extends from a passage inlet (126) along a downstream fuel passage centerline (124), and the passage inlet (126) is disposed at the accumulation chamber (80); and
de_de: der stromabwärtige Brennstoffkanal (114) durch den zweiten Brennstoffdüsenkörper (74) gebildet ist, wobei sich der stromabwärtige Brennstoffkanal (114) von einem Kanaleinlass (126) entlang einer stromabwärtigen Brennstoffkanalmittellinie (124) erstreckt und der Kanaleinlass (126) an der Sammelkammer (80) angeordnet ist; und

source: the plurality of tangential feed holes (116) are formed by the first fuel nozzle body (72), each tangential feed hole (116) of the plurality of tangential feed holes (116) extends between and to a hole inlet (128) and a hole outlet (130), the hole inlet (128) is disposed at the upstream fuel passage (112) upstream of the terminal end (120), the hole outlet (130) is disposed at the accumulation chamber (80), wherein
de_de: die Vielzahl von tangentialen Zufuhrlöchern (116) durch den ersten Brennstoffdüsenkörper (72) gebildet ist, wobei sich jedes tangentiale Zufuhrloch (116) der Vielzahl von tangentialen Zufuhrlöchern (116) zwischen und zu einem Locheinlass (128) und einem Lochauslass (130) erstreckt, wobei der Locheinlass (128) an dem stromaufwärtigen Brennstoffkanal (112) stromaufwärts des Anschlussendes (120) angeordnet ist, wobei der Lochauslass (130) an der Sammelkammer (80) angeordnet ist, wobei

source: the plurality of tangential feed holes (116) includes a first tangential feed hole (116C) and a second tangential feed hole (116D), the hole inlet (128C) of the first tangential feed hole (116C) has a first axial location relative to the upstream fuel passage centerline (118), the hole inlet (128D) of the second tangential feed hole (116D) has a second axial location relative to the upstream fuel passage centerline (118),
de_de: die Vielzahl von tangentialen Zufuhrlöchern (116) ein erstes tangentiales Zufuhrloch (116C) und ein zweites tangentiales Zufuhrloch (116D) beinhaltet, wobei der Locheinlass (128C) des ersten tangentialen Zufuhrlochs (116C) eine erste axiale Position relativ zu der stromaufwärtigen Brennstoffkanalmittellinie (118) aufweist, wobei der Locheinlass (128D) des zweiten tangentialen Zufuhrlochs (116D) eine zweite axiale Position relativ zu der stromaufwärtigen Brennstoffkanalmittellinie (118) aufweist,

source: wherein the first tangential feed hole (116C) is oriented at a first angle relative to the upstream fuel passage centerline (118), the second tangential feed hole (116D) is oriented at a second angle relative to the upstream fuel passage centerline (118),
de_de: wobei das erste tangentiale Zufuhrloch (116C) in einem ersten Winkel relativ zu der stromaufwärtigen Brennstoffkanalmittellinie (118) ausgerichtet ist, wobei das zweite tangentiale Zufuhrloch (116D) in einem zweiten Winkel relativ zu der stromaufwärtigen Brennstoffkanalmittellinie (118) ausgerichtet ist,

source: the first axial location is different than the second axial location, and/or the first angle is different than the second angle.
de_de: die erste axiale Position von der zweiten axialen Position verschieden ist und/oder der erste Winkel von dem zweiten Winkel verschieden ist.

source: 2. The fuel nozzle (70) of claim 1, further comprising a blockage (122) disposed in the first fuel nozzle body (72), wherein the blockage (122) forms the terminal end (120) and a portion of the accumulation chamber (80).
de_de: 2. Brennstoffdüse (70) nach Anspruch 1, ferner umfassend eine Blockierung (122), die in dem ersten Brennstoffdüsenkörper (72) angeordnet ist, wobei die Blockierung (122) das Anschlussende (120) und einen Abschnitt der Sammelkammer (80) bildet.

source: 3. The fuel nozzle (70) of claim 1 or 2, wherein the upstream fuel passage centerline (118) is skewed relative to the downstream fuel passage centerline (124).
de_de: 3. Brennstoffdüse (70) nach Anspruch 1 oder 2, wobei die stromaufwärtige Brennstoffkanalmittellinie (118) relativ zu der stromabwärtigen Brennstoffkanalmittellinie (124) schräg ist.

source: 4. The fuel nozzle (70) of any preceding claim, wherein the hole outlet (130) is radially outward of the hole inlet (128) for each tangential feed hole (116) of the plurality of tangential feed holes (116) relative to the upstream fuel passage centerline (118).
de_de: 4. Brennstoffdüse (70) nach einem der vorhergehenden Ansprüche, wobei sich der Lochauslass (130) radial außerhalb des Locheinlasses (128) für jedes tangentiale Zufuhrloch (116) der Vielzahl von tangentialen Zufuhrlöchern (116) relativ zu der stromaufwärtigen Brennstoffkanalmittellinie (118) befindet.

source: 5. The fuel nozzle (70) of any preceding claim, wherein the passage inlet (126) is radially offset from the upstream fuel passage (112) relative to the upstream fuel passage centerline (118).
de_de: 5. Brennstoffdüse (70) nach einem der vorhergehenden Ansprüche, wobei der Kanaleinlass (126) radial von dem stromaufwärtigen Brennstoffkanal (112) relativ zu der stromaufwärtigen Brennstoffkanalmittellinie (118) versetzt ist.

source: 6. The fuel nozzle (70) of any preceding claim, wherein the first fuel nozzle body (72) forms a distal axial end (82), the second fuel nozzle body (74) forms a proximal axial end (96), the distal axial end (82) and the proximal axial end (96) have a centerline axis (76), and the distal axial end (82) and the proximal axial end (96) form the fuel accumulation chamber (80) at the centerline axis (76).
de_de: 6. Brennstoffdüse (70) nach einem der vorhergehenden Ansprüche, wobei der erste Brennstoffdüsenkörper (72) ein distales axiales Ende (82) bildet, der zweite Brennstoffdüsenkörper (74) ein proximales axiales Ende (96) bildet, das distale axiale Ende (82) und das proximale axiale Ende (96) eine Mittellinienachse (76) aufweisen und das distale axiale Ende (82) und das proximale axiale Ende (96) die Brennstoffsammelkammer (80) an der Mittellinienachse (76) bilden.

source: 7. The fuel nozzle (70) of claim 6, wherein the centerline axis (76) extends through the upstream fuel passage (112).
de_de: 7. Brennstoffdüse (70) nach Anspruch 6, wobei sich die Mittellinienachse (76) durch den stromaufwärtigen Brennstoffkanal (112) erstreckt.

source: 8. The fuel nozzle (70) of claim 6 or 7, wherein the distal axial end (82) includes an end surface (86) and a canted surface (88), the end surface (86) is oriented perpendicular to the centerline axis (76), the canted surface (88) extends circumferentially about the centerline axis (76) and surrounds the end surface (86), and the canted surface (88) faces away from the centerline axis (76).
de_de: 8. Brennstoffdüse (70) nach Anspruch 6 oder 7, wobei das distale axiale Ende (82) eine Endfläche (86) und eine abgeschrägte Fläche (88) beinhaltet, wobei die Endfläche (86) senkrecht zu der Mittellinienachse (76) ausgerichtet ist, wobei sich die abgeschrägte Fläche (88) in Umfangsrichtung um die Mittellinienachse (76) erstreckt und die Endfläche (86) umgibt und die abgeschrägte Fläche (88) von der Mittellinienachse (76) abgewandt ist.

source: 9. The fuel nozzle (70) of claim 8, wherein the hole outlet (130) for each tangential feed hole (116) of the plurality of tangential feed holes (116) is disposed at the canted surface (88).
de_de: 9. Brennstoffdüse (70) nach Anspruch 8, wobei der Lochauslass (130) für jedes tangentiale Zufuhrloch (116) der Vielzahl von tangentialen Zufuhrlöchern (116) an der abgeschrägten Fläche (88) angeordnet ist.

source: The fuel nozzle (70) of any of claims 6 to 9, wherein the downstream fuel passage (114) is radially offset from centerline axis (76).
de_de: Brennstoffdüse (70) nach einem der Ansprüche 6 bis 9, wobei der stromabwärtige Brennstoffkanal (114) radial von der Mittellinienachse (76) versetzt ist.

source: The fuel nozzle (70) of any preceding claim, wherein the second fuel nozzle body (74) forms a cavity (106) and the first fuel nozzle body (72) is disposed within the cavity (106).
de_de: Brennstoffdüse (70) nach einem der vorhergehenden Ansprüche, wobei der zweite Brennstoffdüsenkörper (74) einen Hohlraum (106) bildet und der erste Brennstoffdüsenkörper (72) innerhalb des Hohlraums (106) angeordnet ist.

source: The fuel nozzle (70) of any preceding claim, wherein the plurality of tangential feed holes (116) includes a first tangential feed hole (116A) and a second tangential feed hole (116B), the first tangential feed hole (116A) has a first diameter, the second tangential feed hole (116B) has a second diameter, and the first diameter is different than the second diameter.
de_de: Brennstoffdüse (70) nach einem der vorhergehenden Ansprüche, wobei die Vielzahl von tangentialen Zufuhrlöchern (116) ein erstes tangentiales Zufuhrloch (116A) und ein zweites tangentiales Zufuhrloch (116B) beinhaltet, wobei das erste tangentiale Zufuhrloch (116A) einen ersten Durchmesser aufweist, das zweite tangentiale Zufuhrloch (116B) einen zweiten Durchmesser aufweist und der erste Durchmesser von dem zweiten Durchmesser verschieden ist.

source: The fuel nozzle (70) of any preceding claim, wherein the first fuel nozzle body (72) forms the terminal end (120) of the upstream fuel passage (112) and the upstream fuel passage (112) is connected to the fuel accumulation chamber (80) only by the plurality of tangential feed holes (116).
de_de: Brennstoffdüse (70) nach einem der vorhergehenden Ansprüche, wobei der erste Brennstoffdüsenkörper (72) das Anschlussende (120) des stromaufwärtigen Brennstoffkanals (112) bildet und der stromaufwärtige Brennstoffkanal (112) nur durch die Vielzahl von tangentialen Zufuhrlöchern (116) mit der Brennstoffsammelkammer (80) verbunden ist.
